[
  {
    "showdate": "1983-12-02",
    "venue": "Harris-Millis Cafeteria - University of Vermont",
    "city": "Burlington",
    "state": "VT",
    "country": "USA",
    "setlist_notes": "Trey, Mike, Fish, and Jeff Holdsworth performed what is believed to be their first public gig together as Phish on this night. The band was short on equipment, so a hockey stick was used as a microphone stand. Between sets, the DJ spun some Michael Jackson and Trey drummed along to the album. The house music (which included more Michael Jackson) was presumably turned up after Fire on the Mountain to drown out the band. The setlist may be incomplete, though, as the master recording contains nothing after Trey’s sarcastic comments about Michael Jackson following Fire on the Mountain. All songs were, of course, Phish debuts. Back in Black was teased before Scarlet Begonias. While this show is often billed as an ROTC Halloween Dance that took place on October 30, 1983, this is incorrect. The master copy of the recording of this show, as unearthed by Phish archivist Kevin Shapiro, contains a handwritten note that pegs the date as December 2, 1983. In discussions with Kevin, band members confirmed that they recall rehearsing for this show over the Thanksgiving Break, and that the show was a Christmas semi-formal. Also, it was not an ROTC-sponsored event; it was a dorm dance in a predominantly ROTC dorm (Mike’s dorm at the time). It was long believed that the band's name for this show was \"Blackwood Convention\" but Trey advised in a 2019 radio interview that \"we were never fucking called 'Blackwood Convention.'\"",
    "tour_name": "1983 Tour",
    "sets": {
      "1": [
        {
          "song": "Long Cool Woman in a Black Dress",
          "transition": true,
          "footnote": "Phish debut."
        },
        {
          "song": "Proud Mary",
          "transition": true,
          "footnote": "Phish debut."
        },
        {
          "song": "In the Midnight Hour",
          "transition": true,
          "footnote": "Phish debut."
        },
        {
          "song": "Squeeze Box",
          "transition": true,
          "footnote": "Phish debut."
        },
        {
          "song": "Roadhouse Blues",
          "transition": true,
          "footnote": "Phish debut."
        },
        {
          "song": "Happy Birthday to You",
          "transition": false,
          "footnote": "Phish debut."
        }
      ],
      "2": [
        {
          "song": "Scarlet Begonias",
          "transition": false,
          "footnote": "Phish debut."
        },
        {
          "song": "Fire on the Mountain",
          "transition": false,
          "footnote": "Phish debut."
        }
      ]
    }
  }
]